<?php
//
//　      _    (_)_(_)
//　 ___ | |__  _| |_ _ _ _ __ _ _ __
//　/ __\| __ \| | | | ' ' / _` | '_ \     
//　| |_ | | | | | | | | |  (_| | | | |	 taipei 
//　\___/|_| |_|_|_|_|_|_|_\__,_|_| |_|    2013
//　www.chiliman.com.tw
// 
//*****************************************************************************************
//		撰寫人員：Momo
//		撰寫日期：20151111
//		程式功能：psbfrich / 紀錄會員課程流程頁面判斷 / 判斷跳轉頁面
//		使用參數：None
//		資　　料：sel：manager_m
//		　　　　　ins：None
//		　　　　　del：None
//		　　　　　upt：None
//		修改人員：
//		修改日期：
//		註　　解：
//*****************************************************************************************
	header ('Content-Type: text/html; charset=utf-8');
	session_start();
//定義全域參數
//函式庫
	include_once($_SERVER['DOCUMENT_ROOT'] . "/config.ini.php");
	
//參數
	ADDScore($_COOKIE['MemberNO'],26);
		
?>
