<?php
//
//　      _    (_)_(_)
//　 ___ | |__  _| |_ _ _ _ __ _ _ __
//　/ __\| __ \| | | | ' ' / _` | '_ \     
//　| |_ | | | | | | | | |  (_| | | | |	 taipei 
//　\___/|_| |_|_|_|_|_|_|_\__,_|_| |_|    2013
//　www.chiliman.com.tw
// 
//*****************************************************************************************
	header ('Content-Type: text/html; charset=utf-8');
//	此頁存放有關檔案存取的公用程式
//		DirExist				: 資料夾是否存在
//		MMkDir					: 建立資料夾
//		DeleteDir				: 刪除資料夾
//		FileExist				: 檔案是否存在
//		DeleteFile				: 刪除檔案

//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
//	功能簡述	: 資料夾是否存在
//	撰寫日期	: 20131125
//	撰寫人員	: JimmyChao 整理
//	參數說明	: dName			/ String	/ 資料夾名稱
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
function DirExist($dName){
	if(file_exists($dName)){
		return true;
	}else{
		return false;
	}
}
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
//	功能簡述	: 建立資料夾
//	撰寫日期	: 20131125
//	撰寫人員	: JimmyChao 整理
//	參數說明	: fPath			/ String	/ 資料夾名稱
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
function MMkDir($fPath){
	if(!DirExist($fPath)){
		mkdir($fPath, 0777);
		if(DirExist($fPath)){
			return true;
		}else{
			return true;
		}
	}else{
		return true;
	}
}
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
//	功能簡述	: 刪除資料夾
//	撰寫日期	: 20131125
//	撰寫人員	: JimmyChao 整理
//	參數說明	: path			/ String	/ 資料夾名稱
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
function DeleteDir($path){ 
	if(DirExist($path)){
		unlink($path);
		rmdir($path); 
	}
} 
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
//	功能簡述	: 檔案是否存在
//	撰寫日期	: 20131125
//	撰寫人員	: JimmyChao 整理
//	參數說明	: fPath			/ String	/ 檔案名稱
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
function FileExist($fPath){
	if(is_file($fPath)){
		return true;
	}else{
		return false;
	}
}
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
//	功能簡述	: 刪除檔案
//	撰寫日期	: 20131125
//	撰寫人員	: JimmyChao 整理
//	參數說明	: dName			/ String	/ 檔案名稱
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
function DeleteFile($dName){
	if(FileExist($dName)){
		unlink($dName);
		return true;
	}else{
		return false;
	}
}
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
//	功能簡述	: 取得副檔名以外的檔名
//	撰寫日期	: 20151117
//	撰寫人員	: Momo 整理
//	參數說明	: dName			/ String	/ 檔案名稱
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
function GetFileFirstName($dName){
	$arr = explode('.',$dName);
	return $arr[0];
}
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
//	功能簡述	: 取得副檔名
//	撰寫日期	: 20151117
//	撰寫人員	: Momo 整理
//	參數說明	: dName			/ String	/ 檔案名稱
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
function GetFileExtName($dName){
	$arr = explode('.',$dName);
	return $arr[1];
}
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
//	功能簡述	: Csv檔案中文亂碼處理
//	撰寫日期	: 20161212
//	撰寫人員	: tai 整理
//	參數說明	: dName			/ String	/ 檔案名稱
//'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
function __fgetcsv(&$handle, $length = null, $d = ",", $e = '"') {
	$d = preg_quote($d);
	$e = preg_quote($e);
	$_line = "";
	$eof=false;
	while ($eof != true) {
	$_line .= (empty ($length) ? fgets($handle) : fgets($handle, $length));
	$itemcnt = preg_match_all('/' . $e . '/', $_line, $dummy);
	if ($itemcnt % 2 == 0){
	 $eof = true;
	}
	}
	$_line = iconv("big5","utf-8//ignore",addslashes($_line));
	
	$_csv_line = preg_replace('/(?: |[ ])?$/', $d, trim($_line));
	
	$_csv_pattern = '/(' . $e . '[^' . $e . ']*(?:' . $e . $e . '[^' . $e . ']*)*' . $e . '|[^' . $d . ']*)' . $d . '/';
	preg_match_all($_csv_pattern, $_csv_line, $_csv_matches);
	$_csv_data = $_csv_matches[1];
	
	for ($_csv_i = 0; $_csv_i < count($_csv_data); $_csv_i++) {
	$_csv_data[$_csv_i] = preg_replace("/^" . $e . "(.*)" . $e . "$/s", "$1", $_csv_data[$_csv_i]);
	$_csv_data[$_csv_i] = str_replace($e . $e, $e, $_csv_data[$_csv_i]);
	
	}
	
	return empty ($_line) ? false : $_csv_data;
}
